---
kind: method
id: M:Autodesk.Revit.UI.ComboBoxMemberData.#ctor(System.String,System.String)
source: html/082f904e-47c3-a99d-894a-a87986d42605.htm
---
# Autodesk.Revit.UI.ComboBoxMemberData.#ctor Method

Constructs a new instance of ComboBoxMemberData.

## Syntax (C#)
```csharp
public ComboBoxMemberData(
	string name,
	string text
)
```

## Parameters
- **name** (`System.String`) - The internal name of the ComboBoxMember.
- **text** (`System.String`) - The user visible text seen on the item.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is passed for one or more arguments.
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an empty string is passed for one or more arguments.